Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructural Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElementsStructural { get; }
Public Shared ReadOnly Property CannotJoinElementsStructural As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElementsStructural {
	FailureDefinitionId^ get ();
}
static member CannotJoinElementsStructural : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace